app/views/users/show.html.erb

SELECT COUNT(*) FROM "follows" WHERE "follows"."user_id" = ?  [["user_id", 1]]
---
        <li class="list-group-item">
          <span class="badge"><%= @user.followeeships.count %></span>

SELECT "tags"."tag_name" FROM "tags" INNER JOIN "marks" ON "tags"."id" = "marks"."tag_id" WHERE "marks"."user_id" = ?  [["user_id", 1]]
---
              <% @tags.each do |tag| %>
                <% if @user_tags.include? tag.tag_name %>

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
      <% if @user.posts %>
        <% @user.posts.each do |post| %>

SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "replies" WHERE "replies"."post_id" = ?  [["post_id", 1]]
---
              <a data-toggle="collapse" href="#collapse-<%= post.id %>" aria-expanded="false" aria-controls="#collapse-<%= post.id %>">
                Comments(<%= post.replies.count%>)