app/views/posts/index.html.erb

SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "replies" WHERE "replies"."post_id" = ?  [["post_id", 1]]
---
                <a data-toggle="collapse" href="#collapse-<%= post.id %>" aria-expanded="false" aria-controls="#collapse-<%= post.id %>">
                  Comments(<%= post.replies.count%>)