app/controllers/posts_controller.rb

  def index
    #if user has logged in, read user's posts and user's friends posts
    #if not, read recommend posts

    @restaurants = Restaurant.order("name")

    if session[:user_id].blank?
      #if not logged in, read most recently 20 posts
      @posts = Post.order("id desc").limit(20)

    else
      @user = User.find_by(id:session["user_id"])

      #get first 20 posts and followers posts
      @posts = @user.posts.order("post_time desc").limit(20)
---
SELECT "restaurants".* FROM "restaurants"  ORDER BY name
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ?  ORDER BY post_time desc LIMIT 20  [["user_id", 1]]

  def create
    post = Post.new
    post.post_text = params[:post_text]
    post.rating = params[:rating]
    post.post_time = Time.now.to_datetime
    post.user_id = session[:user_id]

    if post.save
      place = Place.new
      place.post_id = post.id
      place.restaurant_id = params[:restaurant_id]

      if place.save
---
INSERT INTO "posts" ("post_text", "rating", "post_time", "user_id") VALUES (?, ?, ?, ?)  [["post_text", "I love this restaurant!"], ["rating", 5], ["post_time", "2015-07-16 06:06:37.855937"], ["user_id", 1]]
INSERT INTO "places" ("post_id", "restaurant_id") VALUES (?, ?)  [["post_id", 1], ["restaurant_id", 1281]]