app/controllers/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants"  ORDER BY rating desc LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "restaurants"
---
	def index

    if params[:page] && params[:page].to_i > 0
      page = params[:offset].to_i
      @restaurants = Restaurant.order("rating desc").page params[:page]

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 1575]]
SELECT "posts".* FROM "posts" INNER JOIN "places" ON "posts"."id" = "places"."post_id" WHERE "places"."restaurant_id" = ?  ORDER BY id desc  [["restaurant_id", 1575]]
---
  def show

    restaurant = Restaurant.find_by(id:params[:id])

    if restaurant

      @business = Yelp.client.business(restaurant.yelp_id)
      @posts = restaurant.posts.order("id desc")