app/controllers/tags_controller.rb

INSERT INTO "marks" ("user_id", "tag_id") VALUES (?, ?)  [["user_id", 1], ["tag_id", 6]]
---
  def update

    if params["tags"]

      # clear marks
      @user.marks.delete_all

      # add tags

      params["tags"].each do |id|
        mark = Mark.new
        mark.user_id = @user.id
        mark.tag_id = id
        mark.save