app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	def find_user
		@user = User.find_by(id: params["id"])

SELECT  1 AS one FROM "users" WHERE "users"."user_name" = 'xuc@uchicago.edu' LIMIT 1
INSERT INTO "users" ("user_name", "password_digest", "profile_pic_path", "gender", "id_created_time", "nick_name", "place", "last_login_time") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create

		@user = User.new
		@user.user_name = params["user_name"]
		@user.password = params["password"]
		confirmation=params["repassword"]
		@user.profile_pic_path = params["profile_pic_path"].present? ? params["profile_pic_path"] : "default-user-image.png"
		@user.gender = params["gender"] == "1"
		@user.id_created_time = Time.now.to_datetime
		@user.nick_name = params["nick_name"]
		@user.place = params["nick_name"]
		@user.last_login_time = Time.now.to_datetime

		if @user.password == confirmation and @user.save

SELECT  "follows".* FROM "follows" WHERE "follows"."user_id" = ? AND "follows"."follower_id" = ? LIMIT 1  [["user_id", 1], ["follower_id", 1]]
SELECT "tags".* FROM "tags"
SELECT "tags"."tag_name" FROM "tags" INNER JOIN "marks" ON "tags"."id" = "marks"."tag_id" WHERE "marks"."user_id" = ?  [["user_id", 1]]
---
	def show
		if @user !=nil
			@follow = Follow.find_by_user_id_and_follower_id(session[:user_id],params[:id])
		end
		if @user == nil
			redirect_to users_url, notice: "User not found."
		end

    if @user.id == session[:user_id]
      @tags = Tag.all
      @user_tags = @user.tags.pluck("tag_name")